guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
static int fp_crypto_account_key_filter(uint8_t *out, size_t n, uint16_t salt)
{
  size_t s = fp_crypto_account_key_filter_size(n);
  uint8_t v[FP_ACCOUNT_KEY_LEN + sizeof(salt)];
  account_key_t accountkey_array[5]={0};
  uint8_t h[FP_CRYPTO_SHA256_HASH_LEN];
  uint32_t x;
  uint32_t m;
  ret_code_t            err_code;

  err_code = nrf_queue_read(&account_key_queue,accountkey_array,n);
  if(NRF_SUCCESS != err_code)
  {
     NRF_LOG_ERROR("nrf_queue_read err %x\n",err_code);
  }
   for (size_t i=0;i<n;i++)
      {
         err_code = nrf_queue_push(&account_key_queue,(accountkey_array+i));
         if(NRF_SUCCESS != err_code)
          {
            NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
          }
      }

  memset(out, 0, s);
  for (size_t i = 0; i < n; i++) 
  {
    size_t pos = 0;

    memcpy(v, accountkey_array[i].account_key, FP_ACCOUNT_KEY_LEN);
    pos += FP_ACCOUNT_KEY_LEN;

    sys_put_be16(salt, &v[pos]);
      NRF_LOG_INFO(" v[pos] %x v[pos+1] %x",v[pos],v[pos+1]); 
    pos += sizeof(salt);

    nrf_crypto_hash_context_t   hash_context;
    size_t digest_len = NRF_CRYPTO_HASH_SIZE_SHA256;
    // Initialize the hash context
    err_code = nrf_crypto_hash_init(&hash_context, &g_nrf_crypto_hash_sha256_info);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_init err %x\n",err_code);
    }
    // Run the update function (this can be run multiples of time if the data is accessible
    // in smaller chunks, e.g. when received on-air.
    err_code = nrf_crypto_hash_update(&hash_context, v, pos);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
    }

    // Run the finalize when all data has been fed to the update function.
    // this gives you the result
    err_code = nrf_crypto_hash_finalize(&hash_context, h, &digest_len);
    if(NRF_SUCCESS != err_code)
    {
      NRF_LOG_ERROR("nrf_crypto_hash_finalize err %x\n",err_code);
    }

    for (size_t j = 0; j < FP_CRYPTO_SHA256_HASH_LEN / sizeof(x); j++) 
    {
      x = sys_get_be32(&h[j * sizeof(x)]);
      m = x % (s * 8);
      WRITE_BIT(out[m / 8], m % 8, 1);
    }
  }
  return 0;
}

int fp_adv_data_fill_non_discoverable(uint8_t * service_data_nondis , size_t  * plen)
{
  //uint8_t service_data_nondis[26]={0};
  service_data_nondis[0]=0x00;//version_and_flags
  size_t account_key_cnt = nrf_queue_utilization_get(&account_key_queue);
  size_t ak_filter_size = fp_crypto_account_key_filter_size(account_key_cnt);
  ret_code_t            err_code;
  if (account_key_cnt == 0) 
  {
    service_data_nondis[1]=0x00;//empty_account_key_list
    *plen=2;
    NRF_LOG_INFO("no accout key **\n");
  } 
  else 
  {
		
    
    uint8_t m_random_vector[2];
    uint16_t salt;


    err_code = nrf_crypto_rng_vector_generate(m_random_vector, 2);
    if(NRF_SUCCESS != err_code)
    {
        NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
    }

    //test
    //m_random_vector[0]=0x0c;
    //m_random_vector[1]=0x6b;
    salt = (m_random_vector[0] << 8) | m_random_vector[1];
NRF_LOG_INFO("salt ** %x\n",salt);
    service_data_nondis[1] = ((ak_filter_size) << 4) | (FP_FIELD_TYPE_SHOW_PAIRING_UI_INDICATION);
		
    err_code = fp_crypto_account_key_filter((service_data_nondis+2),
						   account_key_cnt, salt);
    if(NRF_SUCCESS != err_code)
    {
        NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
    }
    service_data_nondis[2+ak_filter_size] = (sizeof(salt) << 4) | (FP_FIELD_TYPE_SALT);
    sys_put_be16(salt, &service_data_nondis[2+ak_filter_size+1]);
    *plen=2+ak_filter_size+2+1;

  }
   print_hex(" service_data_nondis: ", service_data_nondis, *plen);

  return 0;
}


